Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_86-The_Question_of_Maitreya_on_the_Eight_Qualities-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་ཏོ།
en: The Blessed One, surrounded by a retinue of many hundreds of thousands, surveyed those before him, and taught the Dharma.

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ
en: At that time, the bodhisattva mahāsattva Maitreya was present among that very retinue.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་སྟན་ལས་ལངས་ཏེ་
en: He rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: draped his shawl over one shoulder, set his right knee on the ground,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: and paid homage with palms joined toward the Blessed One. He then said to the Blessed One

source: ཁྱད་པར་ཐོབ་པར་འགྱུར།
en: will gain special attainments;

source: བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པར་འགྱུར།
en: they will vanquish negative and hostile influences;

source: ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་ནས་འཁོར་བ་ན་ཡོངས་སུ་མི་སྐྱོ་བར་འགྱུར།
en: they will realize the intrinsic characteristics of all phenomena just as they are and therefore be indefatigable in saṃsāra.

source: ཡོངས་སུ་མི་སྐྱོ་བའི་ཡིད་དང་ལྡན་པར་གྱུར་ནས་ཀྱང་གཞན་གྱི་ཁ་ན་མ་ལས་པའི་ཡེ་ཤེས་ཀྱིས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: as well as having that indefatigable mind, through the pristine awareness that does not rely on anything else, they will quickly awaken to supreme, perfect enlightenment and become a buddha.

source: །བརྒྱད་གང་ཞེ་ན།
en: “What are those eight qualities?

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན།
en: Maitreya, they are for bodhisattva mahāsattvas to have excellent intention,

source: གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་ཡིན།
en: excellent giving,

source: ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པ་ཡིན།
en: skill in dedicating merit

source: བྱམས་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན།
en: excellent loving kindness,

source: སྙིང་རྗེ་ཕུན་སུམ་ཚོགས་པ་ཡིན
en: excellent compassion,

source: ཐབས་ལ་མཁས་པ་ཡིན།
en: skill in methods,

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ངེས་པར་བྱུང་བ་ཡིན་ནོ།
en: emancipation in the perfection of wisdom.

source: །བྱམས་པ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “Maitreya, how do such bodhisattvas have excellent intention?

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སངས་རྒྱས་ཀྱི་བསྔགས་པ་འམ།
en: Maitreya, such bodhisattva mahāsattvas, whether they hear praises or

source: བསྔགས་པ་མ་ཡིན་པ་ཐོས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བསམ་པ་ངེས་པ་ཡིན།
en: slander of the Buddha, have the intention to attain supreme, perfect enlightenment.

source: ཆོས་ཀྱི་བསྔགས་པ་འམ་བསྔགས་པ་མ་ཡིན་པ་ཐོས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བསམ་པ་ངེས་པ་ཡིན།
en: Whether they hear praises or slander of the Dharma, they have the intention to attain supreme, perfect enlightenment.

source: དགེ་འདུན་གྱི་བསྔགས་པ་འམ་བསྔགས་པ་མ་ཡིན་པ་ཐོས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བསམ་པ་ངེས་པ་ཡིན་ཏེ།
en: Whether they hear praises or slander of the Saṅgha, they have the intention to attain supreme, perfect enlightenment.

source: བྱམས་པ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་ནི་ཡིན་ནོ།
en: This, Maitreya, is how the bodhisattvas have excellent intention.

source: །བྱམས་པ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: Maitreya, how do such bodhisattvas have excellent application?

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྲོག་གཅོད་པ་སྤངས་པ་ཡིན།
en: Well, Maitreya, such bodhisattva mahāsattvas renounce killing,

source: མ་བྱིན་པར་ལེན་པ་དང་།
en: theft,

source: བརྫུན་དུ་སྨྲ་བ་དང་།
en: falsehood,

source: ཕྲ་མའི་ཚིག་དང་།
en: slander,

source: ངག་རྩུབ་པོ་དང་།
en: harsh speech,

source: བྱམས་པ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: This, Maitreya, is how the bodhisattva mahāsattvas have excellent application.

source: །བྱམས་པ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “Maitreya, how do such bodhisattvas have excellent giving?

source: བྱམས་པ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: This, Maitreya, is how the bodhisattvas have excellent giving.

source: །བྱམས་པ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “Maitreya, how do such bodhisattvas have skill in dedicating merit?

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱམས་པའི་ལུས་ཀྱི་ལས་དང་ལྡན་པ་ཡིན།
en: Well, Maitreya, such bodhisattva mahāsattvas’ physical actions are kind,

source: བྱམས་པའི་ངག་གི་ལས་དང་ལྡན་པ་ཡིན།
en: their verbal actions are kind,

source: བྱམས་པའི་ཡིད་ཀྱི་ལས་དང་ལྡན་པ་ཡིན་ཏེ།
en: and their mental actions are kind.

source: །བྱམས་པ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: This, Maitreya, is how the bodhisattva mahāsattvas have skill in their methods.

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཀུན་རྫོབ་ཀྱི་དོན་ལ་མཁས་པ་ཡིན།
en: Well, Maitreya, such bodhisattva mahāsattvas are skilled in conventional truth,

source: དམ་པའི་དོན་ལ་མཁས་པ་ཡིན།
en: they are skilled in the absolute truth,

source: གཉི་གའི་དོན་ལ་མཁས་པ་ཡིན་ཏེ།
en: they are skilled in both.

source: བྱམས་པ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མཁས་པ་ཡིན་ནོ།
en: “Maitreya, how do such bodhisattva mahāsattvas have skill in their methods?

source: །བྱམས་པ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ངེས་པར་འབྱུང་བ་ཡིན་ཞེ་ན།
en: “Maitreya, how do such bodhisattva mahāsattvas have emancipation in the perfection of wisdom?

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་ལྟར་ཡང་དག་པར་སློབ་སྟེ།
en: Well, Maitreya, such bodhisattva mahāsattvas correctly train

source: འདི་ཡོད་པའི་ཕྱིར་འདི་འབྱུང་།
en: ‘Because one thing exists, another one arises;

source: འདི་སྐྱེས་པས་འདི་སྐྱེ་བ་སྟེ།
en: because this is born, that is born.

source: སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་།
en: Conditioned by birth, aging and death come into being,

source: མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་།
en: as well as misery, lamentations,

source: སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་།
en: suffering, unhappiness,

source: །འདི་མེད་པའི་ཕྱིར་འདི་མི་འབྱུང་།
en: without these conditions, it does not come into being.

source: འདི་འགགས་པས་འདི་འགག་སྟེ
en: ‘When these conditions cease to exist, it also ceases.

source: མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག
en: When ignorance ceases, karmic formations cease.

source: །འདུ་བྱེད་འགགས་པས་རྣམ་པར་ཤེས་པ་འགག
en: When karmic formations cease, consciousness ceases.

source: །རྣམ་པར་ཤེས་པ་འགགས་པས་མིང་དང་གཟུགས་འགག
en: When consciousness ceases, name and form cease.

source: །མིང་དང་གཟུགས་འགགས་པས།
en: When name and form cease,

source: །སྐྱེ་མཆེད་དྲུག་འགགས་པས་རེག་པ་འགག
en: When the six sources of perception cease, contact ceases.

source: །རེག་པ་འགགས་པས་ཚོར་བ་འགག
en: When contact ceases, feeling ceases.

source: སྐྱེ་མཆེད་དྲུག་འགག
en: the six sources of perception cease

source: བྱམས་པ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ངེས་པར་འབྱུང་བ་ཡིན་ནོ།
en: This, Maitreya, is how the bodhisattva mahāsattvas have emancipation in the perfection of wisdom.

source: །བྱམས་པ་
en: “Maitreya,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་
en: if bodhisattva mahāsattvas possess those eight qualities,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཅན་དུ་འགྱུར་ཞིང་མི་ཉམས་ལ་ཡོངས་སུ་མི་ཉམས་ཏེ།
en: they will become irreversibly set on supreme and perfect enlightenment without regressing,

source: ཁྱད་པར་ཐོབ་པར་འགྱུར
en: will gain special attainments;

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་ནས་འཁོར་བ་ན་ཡོངས་སུ་མི་སྐྱོ་བར་འགྱུར།
en: while engaging in the conduct of a bodhisattva, they will realize the intrinsic characteristics of all phenomena just as they are and therefore be indefatigable in saṃsāra.

source: ཡོངས་སུ་མི་སྐྱོ་བའི་ཡིད་དང་ལྡན་ནས་ཀྱང་
en: as well as having that indefatigable mind,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་།
en: the bodhisattva mahāsattva Maitreya,

source: ། གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུ་ལགས་སོ།
en: “Would the Blessed One please, if he has time, answer a certain question that I would like to put to the Tathāgata, the Arhat, the perfectly enlightened Buddha?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One answered the bodhisattva mahāsattva Maitreya,

source: །བྱམས་པ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་། དྲིས་པ་དེ་དང་དེའི་ལུང་བསྟན་པས་ངས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ།
en: “Maitreya, you may put to the Tathāgata, the Arhat, the perfectly enlightened Buddha whatever question you wish. What I shall say in response to your question will cause you to rejoice.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་ཕྱེ་བས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: So, since the Blessed One had given him the opportunity, the bodhisattva mahāsattva Maitreya asked the Blessed One,

source: ཡོངས་སུ་མི་སྐྱོ་བའི་ཡིད་དང་ལྡན་པར་གྱུར་ནས་ཀྱང་གཞན་གྱི་ཁ་ན་མ་ལས་པའི་ཡེ་ཤེས་ཀྱིས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ལགས།
en: And, as well as having that indefatigable mind, through the pristine awareness that does not rely on anything else, to awaken quickly to supreme, perfect enlightenment and become a buddha?”

source: །བྱམས་པ་ལེགས་སོ། །བྱམས་པ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ཁྱོད་ཡང་ལེགས་སོ།
en: “Very good, Maitreya. It is good that you have thought to ask the Tathāgata a question on this point.

source: །བྱམས་པ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ།
en: Therefore, Maitreya, listen well and retain in your mind what I shall explain to you.”

source: དགེ་སློང་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: together with the monks, as well as all the worlds of gods and men, demigods and gandharvas, rejoiced and praised what the Blessed One had said.

source: །འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་བྱམས་པས་ཞུས་པ་ཆོས་བརྒྱད་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་གཉིས་པ་རྫོགས་སོ།།
en: This concludes “The Question of Maitreya‌ on the Eight Qualities,” the forty-second section of The Noble Dharma Discourse, the Great Heap of Jewels, in one hundred thousand sections.

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།།
en: The Indian scholars Jinamitra and Danaśila together with the chief editor and translator Yeshé Dé translated, edited, corrected this text using the revised terminology, and finalized it.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was staying in Rājagṛha, on Vulture Peak Mountain, together with a great saṅgha of 1,250 monks and 10,000 bodhisattvas.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དུ་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཅན་དུ་འགྱུར་ཞིང་མི་ཉམས་ལ་ཡོངས་སུ་མི་ཉམས་ཏེ།
en: Blessed One, how many qualities do bodhisattva mahāsattvas need to possess in order to become irreversibly set on supreme and perfect enlightenment without regressing, without regressing in the slightest, and

source: ཁྱད་པར་ཐོབ་པར་འགྱུར་བ་དང་།
en: to gain special attainments;

source: བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པར་འགྱུར་བ་དང་།
en: to vanquish negative and hostile influences; and,

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་ནས་འཁོར་བ་ན་ཡོངས་སུ་མི་སྐྱོ་བ་དང་།
en: while engaging in the conduct of a bodhisattva, to realize the intrinsic characteristics of all phenomena just as they are and therefore be indefatigable in saṃsāra?

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: “Blessed One, please do so,” said the bodhisattva mahāsattva Maitreya, and listened as the Blessed One had instructed him.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One, in turn, continued,

source: །བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བརྒྱད་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཅན་དུ་འགྱུར་ཞིང་མི་ཉམས་ལ་ཡོངས་སུ་མི་ཉམས་ཏེ།
en: Maitreya, if bodhisattvas possess eight qualities, they will become irreversibly set on supreme and perfect enlightenment without regressing, without regressing in the slightest,

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་
en: and, while engaging in the conduct of a bodhisattva,

source: སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་ཡིན།
en: excellent application,

source: འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་དང་།
en: sexual misconduct,

source: ཚིག་ཀྱལ་བ་
en: gossip.

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་རྣམས་དང་། ཕོངས་པ་དང་སློང་བ་རྣམས་ལ་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་གཏོང་བ་དང་། སྦྱིན་པ་དག་ཏུ་གྱུར་པ་ཡིན་ཏེ།
en: Well, Maitreya, such bodhisattva mahāsattvas give clothes, food, bedding, curative medicines, and necessities to ascetics, brahmins, poor people, and beggars. Their generosity then becomes pure.

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལུས་དང་ངག་དང་། ཡིད་ཀྱིས་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱེད་པ་གང་ཅི་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་དེ།
en: Well, Maitreya, such bodhisattva mahāsattvas dedicate all the accumulations of roots of virtue that they have created through their body, speech, and mind to supreme, perfect enlightenment.

source: བྱམས་པ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པ་ཡིན་ནོ།
en: This, Maitreya, is how the bodhisattva mahāsattvas have skill in dedicating merit.

source: །བྱམས་པ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: Maitreya, how do such bodhisattvas have excellent loving kindness?

source: བྱམས་པ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: This, Maitreya, is how the bodhisattva mahāsattvas have excellent loving kindness.

source: །བྱམས་པ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: Maitreya, how do such bodhisattvas have excellent compassion?

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གནོད་སེམས་མེད་པའི་ལུས་ཀྱི་ལས་དང་ལྡན་པ་ཡིན།
en: Well, Maitreya, the bodhisattva mahāsattvas’ physical actions are without malice,

source: གནོད་སེམས་མེད་པའི་ངག་གི་ལས་དང་ལྡན་པ་ཡིན།
en: their verbal actions are without malice,

source: གནོད་སེམས་མེད་པའི་ཡིད་ཀྱི་ལས་དང་ལྡན་པ་ཡིན་ཏེ།
en: and their mental actions are without malice.

source: བྱམས་པ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: This, Maitreya, is how the bodhisattvas have excellent compassion.

source: འཁྲུག་པ་རྣམས་
en: agitation.

source: མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས།
en: Conditioned by ignorance, karmic formations come into being.

source: འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: Conditioned by karmic formations, consciousness comes into being.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས།
en: Conditioned by consciousness, name and form come into being.

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག
en: Conditioned by name and form, the six sources of perception come into being.

source: །སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ།
en: Conditioned by the six sources of perception, contact comes into being.

source: རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ།
en: Conditioned by contact, feeling comes into being.

source: ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ།
en: Conditioned by feeling, craving comes into being.

source: སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ།
en: Conditioned by craving, grasping comes into being.

source: ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ།
en: Conditioned by grasping, existence comes into being.

source: སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ།
en: Conditioned by existence, birth comes into being.

source: དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་འདི་འབྱུང་བར་འགྱུར་རོ།
en: That is how this great heap of suffering comes into being;

source: །ཚོར་བ་འགགས་པས་སྲེད་པ་འགག
en: When feeling ceases, craving ceases.

source: །སྲེད་པ་འགགས་པས་ལེན་པ་འགག
en: When craving ceases, grasping ceases.

source: །ལེན་པ་འགགས་པས་སྲིད་པ་འགག
en: When grasping ceases, existence ceases.

source: །སྲིད་པ་འགགས་པས་སྐྱེ་བ་འགག
en: When existence ceases, birth ceases.

source: །སྐྱེ་བ་འགགས་པས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འགག་པར་འགྱུར་ཏེ།
en: When birth ceases, aging, death, misery, lamentations, suffering, unhappiness, and agitation cease.

source: དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཤིག་པོ་འདི་འགག་པར་འགྱུར་རོ།
en: That is how this great heap of suffering ceases.

source: གཞན་གྱི་ཁ་ན་མ་ལས་པའི་ཡེ་ཤེས་ཀྱིས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: hrough the pristine awareness that does not rely on anything else, they will quickly awaken to supreme, perfect enlightenment and become a buddha.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: After the Blessed One had spoken these words,
